garyPenhook/PyAvrOCD/svd/attiny806.svd
        <register>
          <name>LUT1CTRLC</name>
          <description>LUT Control 1 C</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INSEL2</name>
              <description>LUT Input 2 Source Selection</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Masked input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEEDBACK</name>
                  <description>Feedback input source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINK</name>
                  <description>Linked LUT input source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENT0</name>
                  <description>Event input source 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENT1</name>
                  <description>Event input source 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO</name>
                  <description>IO pin LUTn-IN2 input source</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0</name>
                  <description>AC0 OUT input source</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0</name>
                  <description>TCB0 WO input source</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0</name>
                  <description>TCA0 WO2 input source</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0</name>
                  <description>TCD0 WOA input source</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0</name>
                  <description>SPI0 MISO source</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQCTRL0</name>
          <description>Sequential Control 0</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEQSEL</name>
              <description>Sequential Selection</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Sequential logic disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFF</name>
                  <description>D FlipFlop</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JK</name>
                  <description>JK FlipFlop</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATCH</name>
                  <description>D Latch</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RS</name>
                  <description>RS Latch</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRUTH0</name>
          <description>Truth 0</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRUTH</name>
              <description>Truth Table</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TRUTH1</name>
          <description>Truth 1</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TRUTH</name>
              <description>Truth Table</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CLKCTRL</name>
      <description>Clock controller</description>
      <baseAddress>0x00800060</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MCLKCTRLA</name>
          <description>MCLK Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock select</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSC20M</name>
                  <description>16/20MHz internal oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCULP32K</name>
                  <description>32.768kHz internal ultra low-power oscillator</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK</name>
                  <description>External clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUT</name>
              <description>System clock out</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKCTRLB</name>
          <description>MCLK Control B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PEN</name>
              <description>Prescaler enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIV</name>
              <description>Prescaler division</description>
              <bitRange>[4:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2X</name>
                  <description>2X</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4X</name>
                  <description>4X</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8X</name>
                  <description>8X</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16X</name>
                  <description>16X</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32X</name>
                  <description>32X</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64X</name>
                  <description>64X</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6X</name>
                  <description>6X</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10X</name>
                  <description>10X</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12X</name>
                  <description>12X</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24X</name>
                  <description>24X</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48X</name>
                  <description>48X</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKLOCK</name>
          <description>MCLK Lock</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LOCKEN</name>
              <description>Lock enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKSTATUS</name>
          <description>MCLK Status</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SOSC</name>
              <description>System Oscillator changing</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC20MS</name>
              <description>20MHz oscillator status</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OSC32KS</name>
              <description>32KHz oscillator status</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTS</name>
              <description>External Clock status</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC20MCALIBA</name>
          <description>OSC20M Calibration A</description>
          <addressOffset>0x11</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CAL20M</name>
              <description>Calibration</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC20MCALIBB</name>
          <description>OSC20M Calibration B</description>
          <addressOffset>0x12</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TEMPCAL20M</name>
              <description>Oscillator temperature coefficient</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC20MCTRLA</name>
          <description>OSC20M Control A</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RUNSTDBY</name>
              <description>Run standby</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC32KCTRLA</name>
          <description>OSC32K Control A</description>
          <addressOffset>0x18</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RUNSTDBY</name>
              <description>Run standby</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
